Documents/ОприходованиеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОприходованиеМатериалов</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияМатериалов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РегистрМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериалов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОприходованиеМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь изменяет материал
// в табличной части "Материалы".
&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)

	// После выбора материала пересчитываем текущую строку:
	// получаем цену, рассчитываем сумму строки
	// и обновляем общую сумму документа.
	ПересчитатьСтрокуМатериалов();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь изменяет количество материала.
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)

	// При изменении количества нужно пересчитать сумму строки.
	ПересчитатьСтрокуМатериалов();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь вручную изменяет цену материала.
&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)

	// При изменении цены нужно пересчитать сумму строки.
	ПересчитатьСтрокуМатериалов();

КонецПроцедуры


// Процедура пересчитывает текущую строку табличной части "Материалы".
// Она проверяет количество и цену, при необходимости получает цену материала,
// рассчитывает сумму строки и затем пересчитывает общую сумму документа.
&НаКлиенте
Процедура ПересчитатьСтрокуМатериалов()

	// Получаем текущую строку табличной части "Материалы".
	СтрМатериал = Элементы.Материалы.ТекущиеДанные;

	// Если текущая строка не выбрана,
	// пересчитывать нечего.
	Если СтрМатериал = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Если количество не заполнено,
	// считаем его равным нулю.
	Если Не ЗначениеЗаполнено(СтрМатериал.Количество) Тогда
		СтрМатериал.Количество = 0;
	КонецЕсли;

	// Если цена не заполнена,
	// считаем ее равной нулю.
	Если Не ЗначениеЗаполнено(СтрМатериал.Цена) Тогда
		СтрМатериал.Цена = 0;
	КонецЕсли;

	// Если материал выбран, но цена пока равна нулю,
	// пытаемся автоматически получить цену материала.
	Если ЗначениеЗаполнено(СтрМатериал.Материал)
		И СтрМатериал.Цена = 0 Тогда

		// Цена получается на сервере.
		// Передаем материал, склад и дату документа.
		СтрМатериал.Цена = ПолучитьЦенуМатериалаНаСервере(
			СтрМатериал.Материал,
			Объект.Склад,
			Объект.Дата);

	КонецЕсли;

	// Рассчитываем сумму строки:
	// количество умножается на цену.
	// Окр(..., 2) округляет результат до двух знаков после запятой.
	СтрМатериал.Сумма = Окр(СтрМатериал.Количество * СтрМатериал.Цена, 2);

	// После пересчета строки обновляем общую сумму документа.
	ПересчитатьОбщуюСумму();

КонецПроцедуры


// Процедура пересчитывает общую сумму документа.
// Она проходит по всем строкам табличной части "Материалы"
// и складывает суммы строк.
&НаКлиенте
Процедура ПересчитатьОбщуюСумму()

	// Переменная для накопления общей суммы.
	Итог = 0;

	// Перебираем все строки табличной части "Материалы".
	Для Каждого СтрМатериал Из Объект.Материалы Цикл
		
		// Добавляем сумму текущей строки к итогу.
		Итог = Итог + СтрМатериал.Сумма;
		
	КонецЦикла;

	// Записываем рассчитанный итог в реквизит документа "ОбщаяСумма".
	// Округляем итог до двух знаков после запятой.
	Объект.ОбщаяСумма = Окр(Итог, 2);

КонецПроцедуры


// Функция выполняется на сервере без контекста формы.
// Она получает цену материала двумя способами:
// 1. Сначала пытается рассчитать учетную цену по остаткам на складе.
// 2. Если остатков нет, берет последнюю цену из регистра сведений "ЦеныМатериалов".
&НаСервереБезКонтекста
Функция ПолучитьЦенуМатериалаНаСервере(МатериалСсылка, СкладСсылка, ДатаДокумента)

	// Если материал не передан,
	// цену определить невозможно.
	Если Не ЗначениеЗаполнено(МатериалСсылка) Тогда
		Возврат 0;
	КонецЕсли;

	// Если дата документа не заполнена,
	// используем текущую дату.
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;

	// Сначала пытаемся взять учетную цену из остатков склада.
	// Это более точный вариант, потому что цена считается по фактической стоимости остатков.
	Если ЗначениеЗаполнено(СкладСсылка) Тогда

		// Создаем запрос к регистру накопления "РегистрМатериалов".
		ЗапросОстатки = Новый Запрос;
		
		// Запрос получает остаток количества и остаток суммы
		// по выбранному материалу и складу.
		ЗапросОстатки.Текст =
		"ВЫБРАТЬ
		|	Остатки.КоличествоОстаток КАК КоличествоОстаток,
		|	Остатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РегистрМатериалов.Остатки(
		|		&Момент,
		|		Материал = &Материал
		|		И Склад = &Склад
		|	) КАК Остатки";

		// Получаем остатки на конец дня документа.
		ЗапросОстатки.УстановитьПараметр("Момент", КонецДня(ДатаДокумента));
		
		// Передаем материал.
		ЗапросОстатки.УстановитьПараметр("Материал", МатериалСсылка);
		
		// Передаем склад.
		ЗапросОстатки.УстановитьПараметр("Склад", СкладСсылка);

		// Выполняем запрос и получаем выборку.
		ВыборкаОстатки = ЗапросОстатки.Выполнить().Выбрать();

		// Если остатки найдены, пробуем рассчитать учетную цену.
		Если ВыборкаОстатки.Следующий() Тогда
			
			// Проверяем, что количество остатка не равно нулю.
			// Это нужно, чтобы избежать деления на ноль.
			Если ВыборкаОстатки.КоличествоОстаток <> 0 Тогда
				
				// Учетная цена рассчитывается как:
				// сумма остатка / количество остатка.
				Возврат Окр(ВыборкаОстатки.СуммаОстаток / ВыборкаОстатки.КоличествоОстаток, 2);
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;

	// Если остатков на складе нет или учетную цену рассчитать не удалось,
	// берем последнюю цену из регистра сведений "ЦеныМатериалов".
	ЗапросЦена = Новый Запрос;
	
	// Запрос получает последнюю актуальную цену материала на дату документа.
	// Используется виртуальная таблица СрезПоследних.
	ЗапросЦена.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныМатериаловСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|		&ДатаЦены,
	|		Материал = &Материал
	|	) КАК ЦеныМатериаловСрезПоследних";

	// Передаем дату получения цены.
	ЗапросЦена.УстановитьПараметр("ДатаЦены", КонецДня(ДатаДокумента));
	
	// Передаем материал.
	ЗапросЦена.УстановитьПараметр("Материал", МатериалСсылка);

	// Выполняем запрос и получаем выборку.
	ВыборкаЦена = ЗапросЦена.Выполнить().Выбрать();

	// Если цена найдена, возвращаем ее.
	Если ВыборкаЦена.Следующий() Тогда
		Возврат ВыборкаЦена.Цена;
	КонецЕсли;

	// Если цена не найдена ни по остаткам, ни в регистре цен,
	// возвращаем 0.
	Возврат 0;

КонецФункции
